{"customPackID":"c6299bb1-6063-4f6a-8d16-dcb30d9a3892","customPackName":"Pampfinder 1.4.1","listCustomBackgrounds":[{"databaseID":1,"timestamp":"1729183045122","id":"ef52ad62-9641-4890-81f5-5a980a1554f7","name":"Adult Daycare Tutor","traits":"3rd Party","boost_ref_1":"3","boost_ref_2":"5","freeFeatID":"GENERAL_Multilingual","skill":"Society","lore":"Regression","description":"You worked as a daycare teacher, but not a traditional one. Instead of teaching actual children you stroved to rehabilitate victims of regression via re-teaching them basic concepts like shapes, colors, math, and language. It can be a stressful job, and with how contagious some forms of regression can be you may have quit out of fear for your own intellect. Either that or you grew tired of changing such big diapers.","src":"Pampfinder"},{"databaseID":1,"timestamp":"1729183045123","id":"1abb7733-731e-4759-a1ca-cb08e424c50f","name":"Caretaker","traits":"3rd Party","boost_ref_1":"0","boost_ref_2":"4","freeFeatID":"25b9afda-594e-4d62-ab6a-78929e8a6894","skill":"Medicine","lore":"Caretaking","description":"Adult babies, actual babies, the disabled, the elderly, even animals! You've devoted much of your life to taking care of any or all of these fine people in need at one point or another. Whatever the reason for your newfound career, your party will not be exempt from your doting.","src":"Pampfinder"},{"databaseID":1,"timestamp":"1729183045123","id":"d86b6b5f-4e98-45c9-bfeb-58844dc82018","name":"Potty Training Graduate","traits":"Uncommon, 3rd Party","boost_ref_1":"2","boost_ref_2":"3","freeFeatID":"GENERAL_Assurance","freeFeatDetail":"Stealth","skill":"Stealth","lore":"Potty Training","description":"You lost your potty training once thanks to regressive magic. Or perhaps you were just an especially late bloomer. Maybe you lost more than that, or perhaps that was it. Despite this humiliating struggle you persisted with the arduous process of re-potty training (and avoided being caught with wet stains) and thusly have been rewarded with both big kid pants and the confidence to make your way out in the world. Whether big kid pants for you means proper underwear or pull-ups due to the occasional accident you may or may not still have is up to you.","src":"Pampfinder"},{"databaseID":1,"timestamp":"1729183045123","id":"621b5068-1b4a-4ff4-b1b6-045377bf0e80","name":"Sex Worker","traits":"3rd Party","boost_ref_1":"2","boost_ref_2":"5","freeFeatID":"GENERAL_Fascinating Performance","skill":"Performance","lore":"Sex Work","description":"For years you spent your nights on the streets or in a brothel. Maybe you even performed your services in broad daylight, possibly even in public spaces just out of sight. You may still even perform your services now as an adventurer, but it is also likely that you became one to escape your career, whether from dissatisfaction or abuse.","src":"Pampfinder"}],"listCustomFeats":[{"id":"ffefc20f-76f3-4f26-aa59-f57eafa6afd5","name":"Advanced Bondage","level":4,"textDescription":"<b>Prerequisite</b> Lady of the Rope Dedication <br><br>You have expanded your training beyond the basics and improved your ability to restrain foes with whatever is available. The Athletics DC to Force Open or Escape nets you use increases from 16 to your class DC or spell DC, whichever is higher, and creatures take a -2 circumstance penalty to checks made to free themselves from manacles, ropes, and other similar bondage tools you have personally applied to them.","traits":"Archetype, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729525431334"},{"id":"6353d923-3d80-4053-96ae-863c48b695b6","name":"Arts & Crafts Expert","textDescription":"You have fine taste in simple creations and enjoy sharing your work. You become trained in Crafting. <b>If you're already trained in Crafting, you instead gain the Specialty Crafting skill feat for Artistry. As soon as you meet the prerequisites for the skill feat Communal Crafting, you gain it.</b>","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045124","listCustomEffects":[{"proficiencyName":"Crafting","effectType":11,"bonusAmount":2,"reference":"5b84059f-c3fa-4e30-a330-55fad939e474"}]},{"id":"2f7ef6a2-25e5-4ff4-83aa-e0f494989ba0","name":"Babysitter Dedication","level":2,"textDescription":"When you take this dedication, choose one willing, non-minion ally to be your charge. As part of your profession you naturally gravitate towards one person who seems to be most in need of your care and your charge receives extra benefits from some Babysitter archetype feats. You can change your designated charge during your daily preparations. Whenever a creature takes a hostile action against your charge and you can see both of them, you gain a +1 circumstance bonus to attack rolls against that creature made before the end of your next turn. At 10th level, this bonus increases to +2.<br>    <br>Additionally, you gain the effects of the *status* spell with your charge as the target until your next daily preparations, and whenever you restore Hit Points to your charge they gain a circumstance bonus to the number of Hit Points restored equal to your level.","traits":"Archetype, Dedication, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729523768454"},{"id":"27bb74e5-5294-482f-90d3-f6ec63083098","name":"Babysitter's Bag","level":4,"textDescription":"<b>Prerequisite</b> Babysitter Dedication<br>-<br><br><br>You gather together various snacks, changing supplies, spare toys, and other bits and bobs necessary to always have something on hand to prevent a tantrum or fill a hungry tummy. You can remove one of these bits from any container on your person up to four times a day to either produce a small morsel that restores 1d4+5 Hit Points to a creature whenever they eat it as an Interact action or to use a toy to replicate the effects of *calm* using your class DC or spell DC (whichever is higher) and targeting only a single creature. A morsel loses efficacy and no longer restores Hit Points after 1 hour.","traits":"Archetype, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729524798813"},{"id":"1df259b7-4692-476d-a1b2-305fb6a64232","name":"Big Kid's Grace","action":0,"textDescription":"<b>Trigger:</b> You would be regressed or have an accident after failing a saving throw.<br><br>Others simply can't compete with how much of a big kid you are. Even when you're filling your pants you always show off your maturity. Attempt a Performance or Society check against the Will DC of all creatures within 30 feet.<br><br><b>Critical Success:</b> You gain a +2 circumstance bonus to the next attack roll, Perception check, saving throw, or skill check you make before the end of your next turn.<br><b>Success:</b> Same as critical success, but the bonus is +1.<br><b>Critical Failure:</b> As critical success, but it's a -2 penalty instead.","traits":"Elf, Visual, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045124"},{"id":"662d15c0-5c9d-403c-9b38-32f2963a71a7","name":"Block-City Rampage","level":14,"textDescription":"<b>Prerequisites</b> Collateral Damage, toybreaker instinct<br><br><br>No toy city can withstand your wrath. When you critically hit or destroy a construct or object, the splash damage you deal with Collateral Damage is doubled, its area is increased to 10 feet, and it ignores the first 5 points of Hardness of any object in its path.","traits":"Barbarian, Rage, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729526905715"},{"id":"b41323d4-17e3-4c58-8bbc-78159b4f9144","name":"Bully's Comeuppance","level":8,"action":1,"textDescription":"<b>Prerequisites</b> Babysitter Dedication, Charge's Protection<br><b>Requirements</b> An enemy triggered Charge's Protection since the end of your last turn.<br><br><br>You take matters into your own hands to dole out punishment to those that would attack your charges. You make a weapon or unarmed Strike against the enemy who triggered Charge's Protection. The Strike ignores an amount of the target's resistance equal to half your level. If the enemy attacked your charge, the Strike deals one extra weapon damage die.","traits":"Archetype, Flourish, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729525253684"},{"id":"cc3d1054-50fd-449d-98ef-1d4110420424","name":"Bullying Hands","level":5,"reqFeats":["85aae442-c248-4a98-8560-015660edc68d"],"textDescription":"You've developed your ghostly hands' skills and strength further so as to better mess with your foes or playfully prank your friends. You can cast telekinetic maneuver once per day as a 2nd-rank arcane innate spell.","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045125","listCustomEffects":[{"proficiencyName":"Telekinetic Maneuver","effectType":9,"bonusAmount":2}]},{"id":"d87b472b-6397-4b55-8ad8-39a78cb5fd4b","name":"Charge's Protection","level":4,"action":0,"textDescription":"<b>Prerequisite</b> Babysitter Dedication <br><br><b>Trigger</b> An ally within your melee reach is hit by an attack, you can see the attacker, and a +2 circumstance bonus to AC would turn the critical hit into a hit or the hit into a miss. <br><br><b>Requirements</b> You have at least one hand free.<br><br><br><br>You deflect the attack against your ally, granting a +2 circumstance bonus to their AC against the triggering attack. This turns the triggering critical hit into a hit, or the triggering hit into a miss. If the ally was your charge, they also gain resistance to the attack's damage equal to 2 + your level.","traits":"Archetype, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729524775956"},{"id":"8dbbcb0a-4bb0-4df4-b539-a58e86169174","name":"Collateral Damage","level":6,"textDescription":"<b>Prerequisite</b> toybreaker instinct<br><br><br>You don't just break toys: you utterly destroy them, sending parts and fluff flying everywhere and making an utter mess. When you critically hit or destroy a construct or object, you deal splash damage of the same type as your additional damage from Rage equal to your Strength modifier to all creatures and objects other than yourself within 5 feet of the target.","traits":"Barbarian, Rage, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729526405929"},{"id":"7ea9f49e-b497-4fe7-9f5b-61288934a500","name":"Construct Empathy","textDescription":"Your nature as a construct-like creature grants you a unique understanding of constructs. You can use Diplomacy to Make an Impression on mindless constructs or make simple requests of them. If a mindless construct is controlled by a creature whose level is higher than yours, you typically need a critical success on your Diplomacy skill check.","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045125"},{"id":"5745b9ee-a851-4c4a-9099-fdf78582fb4c","name":"Conversion","level":17,"action":3,"textDescription":"<b>Frequency:</b> once per day<br><br>You no longer simply desire companionship. You demand it, and you know the best ways to make more friends. You touch a living, humanoid creature and impart them with a 'gift' of some sort, be it latex slime, piss-soaked diaper jelly, a plastic ball from your body, or simply the sheer love radiating from your cuddles. The creature must attempt a Fortitude saving throw against your class DC or spell DC, whichever is higher. On a critical failure, they begin to transform into a synthetic of your heritage. This transformation process completes after 10 minutes, and they or other creatures can reverse it through abilities and spells that can counteract magic, amputation of limbs, curative alchemy, or whatever else the GM deems appropriate in context. If not reversed, the creature's statistics are replaced with that of a commoner's, and they are permanently stupefied 3, clumsy 2, and enfeebled 1 as they are turned into a perpetually horny and silly member of your kind.","traits":"Synthetic, Rare, Arcane, Curse, Polymorph, Incapacitation, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729522154731"},{"id":"7bd16382-b366-4efd-8737-dfad120dfd13","name":"Cozy Companion","level":9,"textDescription":"Many synthetics are hollow inside or can open up parts of their body to expose the soft insides to the world, but most never make practical use of this aside from holding the occasional item or two. You have adapted your hollowness to be like a suit of armor that can be worn by a friend. Over the course of 10 minutes, you can allow a willing creature to inhabit the inside of your body. While worn this way you both share initiative and actions, a Multiple Attack Penalty, and gain the Act Together action as per the Summoner class, though instead of an eidolon it is you or the wearer.<br> For AC and saving throws you use the lowest modifier between yourselves due to the awkwardness of your body. When you or the wearer take damage, the damage is split as equally as possible between you and the wearer before applying resistances and weaknesses. A creature can independently target you or your wearer. When a creature targets one of you with a Strike or similar single target effect, only the target is subjected to effects like poison, but you both suffer when targeted by multi-target or area effects. Your Speed is used for the both of you, though your wearer cannot use special movement Speeds you have access to (such as flight or burrowing); only you can. <br>    You also share hands, though both of you can use your weapon and skill proficiencies normally. Due to the awkwardness of your shared fingers, if your wearer is capable of casting spells they are only able to cast highly practiced magic. While wearing you, a spellcaster only has access to spell slots 2 ranks lower than their highest rank spell slot. Similarly, you are subject to the same penalties on account of the wiggly little sausages in your glove-like hands. As you cover your wearer's body entirely, they do not have access to items they wear beneath nor do they benefit from armor specialization effects.<br>    When you are reduced to 0 Hit Points, your wearer is ejected from your body into the nearest available space, forcefully moving creatures of your size or smaller up to 5 feet or standing atop your body if necessary. If your wearer is reduced to 0 Hit Points before you they remain inside of you. You can eject your wearer as a three-action activity into the nearest available space.","traits":"Synthetic, , 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729522115179"},{"id":"45e9f3d4-8228-490e-b1de-47bc28a93276","name":"Destructive Strike","level":12,"action":1,"textDescription":"<b>Prerequisite</b> toybreaker instinct<br><br><br>Even the toys you're currently playing with can be smashed to do more damage! Make a melee Strike. If the Strike hits, you deal additional damage equal to the weapon's Hardness, but the weapon also takes double this damage (ignoring its own Hardness). You can use weapons that are broken with Destructive Strike. You can't use Destructive Strike if your weapon can't typically be broken or destroyed. If you have Collateral Damage, destroying your weapon with this Strike counts as destroying an object.","traits":"Barbarian, Rage, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729526836805"},{"id":"82decdd6-7722-452c-8a24-93e08ccceb6f","name":"Expanded Forms","level":5,"reqSpecials":["Mimic"],"textDescription":"Through training and growth you have learned how to transform into objects other than your own kind to better blend into a given environment. When you Change Shape, the object form can be any simple Small or Tiny object from the immediate environment instead of your usual form. In addition, once per day when you Change Shape, you can instead replicate the effects of the *cozy cabin* spell, with you yourself being the cabin. The aesthetics of the cabin is up to you, rather than being standardized, and you can replace the furniture as appropriate, such as swapping the chamber pot with a changing table.","traits":"Synthetic, Mimic Synthetic, Change Shape, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729521831151"},{"id":"f9cbf751-433d-4f7e-b032-1bb1e12c4ef8","name":"Face-Sit","level":8,"action":-1,"textDescription":"<b>Prerequisite</b> Suplex, Wrestler Dedication<br><b>Frequency</b> Once per turn<br><b>Trigger</b> You successfully knock a creature prone with Suplex.<br><br><br><br>You can quickly position yourself on top of your opponent after throwing them to the ground and introduce them to your ass. Make an Athletics check to Grapple the target. In addition to the effects of a success or critical success, you share a space with the creature for as long as you are sitting on their face, and you can continue to do so with subsequent successful Grapple checks. While grabbed or restrained this way, the target must hold its breath or begin suffocating.","traits":"Archetype, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729525940810"},{"id":"dbb61966-40e3-470c-8816-86c2fe1024fb","name":"Floaties","reqSpecials":["Inflated"],"textDescription":"Your body is equipped with flippers, floaties, and other swimming aids that help you to navigate the water, albeit not particularly quickly. You gain a swim Speed of 10 feet.","traits":"Synthetic, Inflated Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045126"},{"id":"85aae442-c248-4a98-8560-015660edc68d","name":"Ghost Hands","reqSpecials":["Time To Play"],"textDescription":"Play-Time synthetics sometimes delve further into the caretaking aspects of their existence, utilizing extra hands for easy mess clean up. You can cast telekinetic hand as an arcane innate spell at will. This cantrip is heightened to a spell rank equal to half your level rounded up. When casting the spell this way, you can conjure two hands instead of one. If you do, you can choose to handle two objects at once, moving both either together or in different directions when the spell is first cast and Sustained.","traits":"Synthetic, Play-Time Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045127","listCustomEffects":[{"proficiencyName":"Mage Hand","effectType":9,"int0":1,"reference":"1db91d3c-78d2-44f7-8a03-56120df2ce8e"}]},{"id":"673ebe27-2c1e-48cd-9d00-78e3e21e1937","name":"Goblin Gas","level":5,"textDescription":"You let loose a disgusting fart or belch, packing your pampers. Attempt a Fortitude save to recover from the sickened condition as if you had spent an action retching; you reduce your sickened condition value by 2 on a success, or by 3 on a critical success.<br>    <br>You also expel stink when you do so and force hostile creatures within a 10 foot emanation to attempt their own Fortitude saves against your class DC or spell DC (whichever is higher), becoming sickened 1 on a failure or sickened 2 on a critical failure.","traits":"Goblin, Olfactory, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729522366950"},{"id":"486fbde6-cd9b-47c8-a4de-21f665c8ef95","name":"Hefty Huggies Hug","level":12,"action":1,"textDescription":"<b>Prerequisite</b> Wrestler Dedication<br><b>Requirements</b> You have a creature grabbed or restrained.<br><br><br><br>You give your opponent's tummy an encouraging squeeze, pressuring their bowels. Attempt an Athletics check to Grapple a creature you have grabbed or restrained, with the following additional effects if you succeed.<br><b>Critical Success</b> The target is sickened 2 and messes themselves immediately.<br><b>Success</b> The target is sickened 1 and messes itself whenever it successfully removes the condition.","traits":"Archetype, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729525936469"},{"id":"bbb1d5ca-a2ef-4370-9ad2-f8aee5285b94","name":"High In The Sky","level":9,"action":1,"reqSpecials":["Inflated"],"textDescription":"<b>Frequency:</b> once per day<br><br>With a deep breath you inflate yourself further. You gain a fly Speed equal to your Speed for 10 minutes. While inflated this way, your weakness to piercing damage is temporarily increased to half your level.","traits":"Synthetic, Inflated Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045127"},{"id":"636cd1a7-6b59-4c98-9950-bbeaac978bf2","name":"L'il Divinity","textDescription":"You have been blessed with divine youth. Your size becomes Small, if it wasn't already, and you no longer age naturally. You can cast <i>conjure change</i> as an innate divine cantrip.","traits":"Nephilim, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729522509715"},{"id":"6fbdfd17-9824-4edb-99a0-a93c889ed6d7","name":"Lady of the Rope Dedication","level":2,"reqSpecials":["Followers of Esmel have access to this archetype"],"textDescription":"You're used to tying up loose ends. You are trained with the bola and the whip. Whenever you gain a class feature that grants you expert or greater proficiency in a given weapon or weapons, you also gain that proficiency in these weapons.<br><br>    At 5th level, whenever you get a critical hit with these weapons, you get its critical specialization effect.","traits":"Uncommon, Archetype, Dedication, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729525323088"},{"id":"5ab81cbc-eba1-4bdd-ba3f-0f48a5dcf19a","name":"Layering Adept","level":13,"reqSpecials":["Absorbent"],"textDescription":"You and diapers are one and the same. When investing a magical diaper, you can layer another magical diaper over the first one and invest it as well. If you do so, both diapers only count as one invested magical item for your limit on invested items. At 17th level, you can layer on a third magical diaper in the same manner.","traits":"Synthetic, Padded Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045128"},{"id":"3962998a-fd9c-4cf6-9b2c-7010575ab091","name":"Lighter Than Air","level":5,"reqSpecials":["Inflated"],"textDescription":"The air inside of your body isn't air at all, but rather helium or some other especially light gas. <b>You are permanently under the effects of the gentle landing spell, though this effect is non-magical.</b>","traits":"Synthetic, Inflated Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045128","listCustomEffects":[{}]},{"id":"979fd310-5061-465d-a35b-91368589f359","name":"Magic Diaper Bag","level":5,"textDescription":"You have utilized some of your animating magic to enchant one of your bags for caretaking purposes. While you have this bag on your person, you have the Prescient Planner feat, and it contains an endless supply of diapers. At 10th level, you gain the Prescient Consumable feat through the bag. In the event that the bag is destroyed or lost, you can enchant another bag over the course of a week. Already magical bags, such as a spacious pouch, cannot be enchanted this way.","traits":"Synthetic, 3rd Party","src":"Pampfinder","hashMapRequiredProficiences":{"Crafting":4},"databaseID":1,"timestamp":"1729183045128"},{"id":"11a5f468-34e2-46fb-9a82-c48fd5dc2c7f","name":"New & Improved: Dark Synthetic","level":5,"textDescription":"You've grafted on new parts or enchanted yourself with extra capabilities that are more like another type of synthetic, granting you the benefits of another heritage. Choose one synthetic heritage that you do not already have; you gain that heritage and its benefits.","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045128","listCustomEffects":[{"effectType":19,"string0":"7613fb3f-d553-4498-9ab2-b0a9cd5fe1ef","reference":"43b01147-b791-4c71-bcd9-8dd6d56c8411"}]},{"id":"fedbbcaf-9d57-427c-bb76-f884c5239969","name":"New & Improved: Inflated Synthetic","level":5,"textDescription":"You've grafted on new parts or enchanted yourself with extra capabilities that are more like another type of synthetic, granting you the benefits of another heritage. Choose one synthetic heritage that you do not already have; you gain that heritage and its benefits.","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045129","listCustomEffects":[{"effectType":19,"string0":"a3cbd147-4cbe-4295-b99f-3146819d7332","reference":"43b01147-b791-4c71-bcd9-8dd6d56c8411"}]},{"id":"a1081111-55dc-4682-8464-79d8db5a01df","name":"New & Improved: Mimic Synthetic","level":5,"textDescription":"You've grafted on new parts or enchanted yourself with extra capabilities that are more like another type of synthetic, granting you the benefits of another heritage. Choose one synthetic heritage that you do not already have; you gain that heritage and its benefits.","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045129","listCustomEffects":[{"effectType":19,"string0":"51be44ad-e71e-40e8-9321-a81724a0f722","reference":"43b01147-b791-4c71-bcd9-8dd6d56c8411"}]},{"id":"5dba811e-6924-4dc3-81af-c782e93bb1aa","name":"New & Improved: Padded Synthetic","level":5,"textDescription":"You've grafted on new parts or enchanted yourself with extra capabilities that are more like another type of synthetic, granting you the benefits of another heritage. Choose one synthetic heritage that you do not already have; you gain that heritage and its benefits.","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045129","listCustomEffects":[{"effectType":19,"string0":"e513b414-60ed-4121-9d06-4862e9b8d726","reference":"43b01147-b791-4c71-bcd9-8dd6d56c8411"}]},{"id":"bbf433ae-cf5a-4729-ae69-50b64b48005e","name":"New & Improved: Play-Time Synthetic","level":5,"textDescription":"You've grafted on new parts or enchanted yourself with extra capabilities that are more like another type of synthetic, granting you the benefits of another heritage. Choose one synthetic heritage that you do not already have; you gain that heritage and its benefits.","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045129","listCustomEffects":[{"effectType":19,"string0":"c01e9c5d-eac5-4832-9864-103bb0f95d3a","reference":"43b01147-b791-4c71-bcd9-8dd6d56c8411"}]},{"id":"68368c47-3a68-4aef-b885-5cdb5cbd92a3","name":"Objectophile","level":5,"reqFeats":["7ea9f49e-b497-4fe7-9f5b-61288934a500"],"textDescription":"Empathy and understanding of the inanimate has evolved to outright infatuation. Ever the lover, you can use Diplomacy in lieu of Thievery when unlocking or disarming a trap or lock, and also instead of Arcana, Nature, Occultism, or Religion when identifying magical items. You don't need thieves' tools to unlock or disarm this way and you also gain a +1 circumstance bonus to Diplomacy checks against sentient magical items.","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045130"},{"id":"b70985df-56c4-4c36-80b9-d6d0fa680916","name":"Plentiful Love","level":6,"textDescription":"<b>Prerequisite</b> Babysitter Dedication<br><br><br>You can select a second charge during your daily preparations. If you have Babysitter's Bag, you can use its effects two more times per day.","traits":"Archetype, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729525068162"},{"id":"a3e74033-65d5-460d-a4fe-176e37ee3005","name":"Potty Break-Out","level":6,"action":2,"textDescription":"<b>Prerequisites</b> Potty Dance Stance<br><br><b>Requirements</b> You are in Potty Dance Stance.<br><br><br>You thrash about desperately, pushing foes out of the way and risking the removal of your other hand's pressure so that you can possibly make it to the potty. You can attempt to Escape using an Athletics or Acrobatics check if you are currently grabbed by a foe. Then, you can make an Athletics check to Shove each enemy within your melee reach. Each attack counts toward your multiple attack penalty, but don't increase your penalty until you have made all of your attacks. You may or may not have an accident as you lose your focus.","traits":"Monk, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729558766804"},{"id":"7038c6ce-e72b-4c70-b8c6-76823bc8eada","name":"Potty Dance","textDescription":"<b>Frequency</b> once per day<br><br><b>Trigger</b> You would be regressed or have an accident after failing a saving throw.<br><br>Whether due to your own struggle with incontinence or constant encounters with regression traps, you have kept up the proud tradition of the potty dance even now to stave off the worst of these effects. You can re-roll the triggering saving throw and use the better result.<br>","traits":"Human, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045130"},{"id":"c0177176-e7e7-41bd-8a5b-c242558ea328","name":"Potty Dance Stance","action":1,"textDescription":"<b>Requirements</b> You are unarmored.<br><br><br>You enter a desperate stance to maintain the sunny stickers on your potty chart, constantly dancing in place with one hand pressed to your crotch. While in this stance, you gain a +2 circumstance bonus to saving throws made to avoid being regressed or having an accident. The only Strikes you can make are door knocker unarmed attacks. These deal 1d8 bludgeoning damage; are in the brawling group; and have the agile, finesse, nonlethal, shove, and unarmed traits.","traits":"Monk, Stance, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729558644269"},{"id":"845527a7-d789-430f-af11-46ead1a13e8b","name":"Quadruped","textDescription":"Your body is quadrupedal instead of bipedal, though you were still blessed with two appendages that function as hands. Your Speed is 30 feet.<br><b>Special:</b> You can take this feat only at 1st level, and you<br>can't retrain into or out of this feat.","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045130","listCustomEffects":[{"effectType":1,"bonusType":3,"bonusAmount":5}]},{"id":"e3f3baeb-3fa0-4cf8-a13e-84f9c89f9449","name":"Quick Trick","action":-1,"reqSpecials":["Mimic"],"textDescription":"<b>Trigger:</b> You roll Deception or Stealth for initiative and would be observed by one or more creatures other than your allies.<br><br>You quickly assume your object form in an effort to trick your foes and hide from danger. As part of this action, you attempt to Hide with a -4 circumstance penalty. On a success, creatures that would have observed you rationalize your previous appearance as being some sort of hallucination or illusion that was intended to make your cohort seem more populous than it \"really\" is.","traits":"Synthetic, Mimic Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045130"},{"id":"efd3c246-582c-4c2a-85b2-c2886616711a","name":"Rope Bunny's Squeal","level":8,"textDescription":"<b>Prerequisite</b> Lady of the Rope Dedication<br><br><br><br>When you have someone tied up and the free time to play with them, they can't help but pour their hearts out. You can spend an hour with someone you have restrained and 'convince' them to divulge information with a Diplomacy or Performance check against their Will DC. On a success, they are subjected to the failure effects of a 3rd-rank *ring of truth* for 10 minutes, their squeals replacing the bell, becoming temporarily immune for 24 hours after.","traits":"Archetype, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729525487716"},{"id":"ed080302-beb1-4aa7-96af-b2ddf3bdbd8b","name":"Scent-Lock Technology","level":5,"reqSpecials":["Absorbent"],"textDescription":"Being a diaper can get a little messy sometimes. You have grown pretty used to being messy, and may have gotten more than a few complaints about the smell, so you've modified your body to better contain ickiness. You gain resistance 3 to poison damage, and you gain a +2 circumstance bonus to saving throws against olfactory effects.","traits":"Synthetic, Padded Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045131"},{"id":"2054a576-c16b-4117-af4c-ab45849e172c","name":"Squat Relief","action":0,"textDescription":"<b>Trigger:</b> You would be regressed or have an accident after failing a saving throw.<br><br>Dwarves make messes despite popular belief, and it can even purge their system. You can immediately repeat a saving throw against an ongoing hostile effect you previously failed against other than the trigger.","traits":"Dwarf, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729522465727"},{"id":"3c00bfa6-a93f-4727-9ef0-7b30aeb7fbe8","name":"Summon Playmate","level":13,"textDescription":"Your desire for companionship is so great that you can bring forth playmates from wherever they may be. You can cast summon construct once per day as a 5th-rank arcane innate spell. The summoned construct's appearance is appropriate for your synthetic heritage -<br>its skin resembling a diaper, being covered in latex and rubber, etc. - but this does not affect its statistics. The construct is otherwise still recognizable as an example of one of its kind.","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045131","listCustomEffects":[{"proficiencyName":"Summon Construct","effectType":9,"bonusAmount":1,"int0":4}]},{"id":"a704c8a1-c409-4d27-86fc-20a4495f57b8","name":"Super Absorbent Polymer","reqSpecials":["Absorbent"],"textDescription":"Diapercritters, while absorbent, can only swell so much before leaking and later becoming dry. But not all diapercritters are made equal; whether you've been stuffed with more SAP or have magically enhanced your absorbency, you can handle the biggest of spills! <b>You gain resistance 3 to damage from water effects, and have a +2 circumstance bonus to saving throws against them. Depending on the liquid involved, this may also apply to other effects at the GM's discretion.</b>","traits":"Synthetic, Padded Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045131"},{"id":"ae0e5874-ef29-4509-8ff0-cdb99affcb16","name":"Trap Breaker","level":4,"action":0,"textDescription":"<b>Prerequisite</b> toybreaker instinct<br><b>Frequency<b> once per day<br><b>Trigger<b> A trap within your reach is triggered.<br><br><br>You resent traps and have an uncanny instinct for reflexively destroying them before they can affect you. Make a melee Strike against the triggering trap. If your attack is a critical hit, you disrupt it, delaying the activation until the end of your next turn. If you destroy the trap, it doesn't activate at all.</b></b></b></b>","traits":"Barbarian, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729526255523"},{"id":"6511c765-fb74-4809-9d97-5af01636f95b","name":"Trap Sense","textDescription":"<b>Prerequisite</b> toybreaker instinct<br><br><br>You have an intuitive sense that alerts you to the dangers and presence of traps while you're in the throes of a tantrum. While Raging, you gain a +1 circumstance bonus to Perception checks to find traps, to AC against attacks made by traps, and to saves against traps. If you have master proficiency in Perception, your circumstance bonuses against traps increase to +2 and you can Seek as a free action at the start of each of your turns while Raging, but can only find traps when you Seek this way.","traits":"Barbarian, Rage, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729526457627"},{"id":"d3653317-ffd2-4f69-908b-c8b5b65aa41e","name":"True Submission","level":16,"action":3,"textDescription":"<b>Prerequisite</b> Lady of the Rope Dedication<br><b>Frequency</b> Once per day<br><br><br><br>One look into your eyes, a flash of your teeth, and your powerful caress can be enough to make potential pets fall on their knees and worship you. Make a Diplomacy or Performance check against the Will DC of a target you have personally restrained. On a success, the target acts as if it critically failed against a 6th-rank *dominate*. Regardless of the result, the target becomes immune for 24 hours.","traits":"Archetype, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729525546618"},{"id":"331eaf75-a54a-4a1e-b469-0aec211995de","name":"Voracious Consumption","level":10,"action":1,"textDescription":"<b>Prerequisites</b> Voracious Stance<br><br><b>Requirements</b> You are in Voracious Stance and have a creature your size or smaller grabbed.<br><br><br>You dislocate your jaw and lift your prey into your hungry gullet, attempting to swallow them whole. Make an Athletics check against the creature's Reflex DC. If it succeeds, you swallow them, placing them inside of you in your space and freeing up your hands but preventing them from being attacked. <br> <br>    A swallowed creature is grabbed, slowed 1, and has to hold its breath or start suffocating. When first swallowed and at the end of each of its turns, the creature takes 2d6 acid damage as you digest it. A swallowed creature can attack you, but only with unarmed attacks or with weapons of light Bulk or less. You are off-guard against the attack. <br><br><br>If you take damage equal to twice your level from a single attack this way, you vomit up the swallowed creature. If the victim Escapes, it exits through your mouth into a space adjacent to you and can immediately breathe.  You can only have one creature swallowed at a time. If a creature dies while you have it swallowed, you can potentially mess out the remains. At the GM's discretion, if a creature is made of a harmful substance such as fire or acidic slime, you may take persistent damage until the swallowed creature is freed or destroyed. You cannot swallow incorporeal creatures.","traits":"Monk, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729559146940"},{"id":"15e0a87e-3135-4f5d-a15c-1f0f5facf252","name":"Voracious Stance","level":4,"action":1,"textDescription":"<b>Requirements</b> You are unarmored.<br><br><br>You rub your tummy and lick your lips before entering a grabby stance, crouching low in preparation to restrain foes. While in this stance, the only Strikes you can make are hungering swipe unarmed attacks. These deal 1d6 bludgeoning damage; are in the brawling group; and have the agile, finesse, grapple, nonlethal, and unarmed traits.<br><br>    While in Voracious Stance, you gain a +1 circumstance bonus to Grapple foes, and creatures you grab suffer a -1 circumstance penalty to Escape.<br>","traits":"Monk, Stance, 3rd Party","src":"Custom","databaseID":1,"timestamp":"1729558918710"},{"id":"25b9afda-594e-4d62-ab6a-78929e8a6894","name":"Wet Nurse","textDescription":"<b>Prerequisites</b> trained in Medicine<br><br><b>Frequency</b> once per hour<br><br>When you Treat Wounds, you can feed another creature breastmilk (either from yourself or via a prepared bottle) to help them recover faster on top of traditional treatment. <br> The target receives a full meal's worth of nourishment. In addition, you automatically get a success on your check instead of rolling, but only restore half as many hit points. The target doesn't become immune to Treat Wounds when you treat them this way.","traits":"Skill, Exploration, Manipulate, 3rd Party","src":"Pampfinder","hashMapRequiredProficiences":{"Medicine":2},"databaseID":1,"timestamp":"1729779194737"},{"id":"79a49335-92db-4572-b5f5-1080effea521","name":"Where There's a Whip...","textDescription":"You have innate insight when it comes to making submissive sorts squirm. You become trained with the whip and the Intimidation skill. At 5th level, whenever you get a critical hit with a whip, you get its critical<br>specialization effect. In addition, when a target is knocked prone by said effect, they suffer from a -2 circumstance penalty to Will saves until the end of your next turn.","traits":"Dark Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1723056750263","listCustomEffects":[{"proficiencyName":"Intimidation","effectType":11,"bonusAmount":2}]},{"id":"54b78ec4-5887-406c-98e8-8fdcd6b4c165","name":"Youthful Veins","reqFeats":["636cd1a7-6b59-4c98-9950-bbeaac978bf2","SORCERER_Blessed Blood"],"textDescription":"Your spilled blood can also impart similar effects to <i>FOY water</i>. Whenever a mortal creature that ages naturally and is not already regressed or a child deals piercing or slashing damage to you within your reach, they are splashed with your blood and must make a Fortitude saving throw against your class DC or spell DC, whichever is higher. On a failure, they are regressed as per <i>FOY water</i> and become clumsy 1, enfeebled 1, and stupefied 1 for 1 minute. At the end of each of their turns they can repeat the saving throw to potentially end the regression early. On a success, they become temporarily immune to your blood for 10 minutes. You gain a +4 circumstance bonus to Crafting checks to Craft <i>FOY water</i> using your blood as one of the ingredients.","traits":"Nephilim, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045131"}],"listCustomHeritages":[{"id":"7613fb3f-d553-4498-9ab2-b0a9cd5fe1ef","name":"Dark Synthetic","textDescription":"Your body is composed of shiny and black rubber or latex. You may be a sex doll of sorts with a fetish-mask for a face, or simply a featureless humanoid made of slick material. Bondage is especially titillating for you, and your foes will find that you are very eager to embrace them and a big, tight hug. You are trained in Athletics and have a +1 circumstance bonus to Athletics checks made to Grapple creatures.","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729521000918","listCustomEffects":[{"effectType":13,"string0":"89462ef8-73da-498a-b801-6e018367ec9f","int0":1}]},{"id":"a3cbd147-4cbe-4295-b99f-3146819d7332","name":"Inflated Synthetic","textDescription":"You may be made up of a rubber or cloth-like material, but most important to you is that your body is hollow and filled with air. You may be a balloon or a pool toy. Some would say adventuring isn't the smartest career decision, but you're able to confound foes with your lighter than air qualities. <b>You have weakness to piercing damage equal to one-fourth your level (minimum 1) and can Step into difficult terrain.</b>","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045132","listCustomEffects":[{"effectType":13,"string0":"4b02f886-abdc-496c-b8bd-1ccbf6b6dbf7","int0":1,"reference":"8a16542a-256a-40a5-ae55-cac3f8658f16"}]},{"id":"51be44ad-e71e-40e8-9321-a81724a0f722","name":"Mimic Synthetic","textDescription":"You are made to resemble a common household object such as a training<br>potty, chest, vase, etc. This is the most common form of synthetic to be given a spark of life as opposed to being a transformed, pre-existing living creature. You are capable of swapping between an object form, which you may be more comfortable in, and a humanoid form which is more suitable for adventuring. You gain the Change Shape action.","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045132","listCustomEffects":[{"effectType":13,"string0":"f5a6cb83-383c-4e70-b8fb-d2110c93a13d","int0":1,"reference":"f9b46eb4-e41d-4521-b5c2-923bc9003b6c"}]},{"id":"e513b414-60ed-4121-9d06-4862e9b8d726","name":"Padded Synthetic","textDescription":"Your body is made up of the soft, absorbent, cloud-like plastic of a disposable diaper, lined with adhesive tapes that hold your form together. You're better fit to handle life's messes, even thriving off of them, though even you have your limits. You can eat and drink things when you are sickened, and can even subsist on others' waste if need be. <b>Your circumstance bonus against disease, poison, and the sickened condition increases to +2.</b>","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045132","listCustomEffects":[{"effectType":13,"string0":"f91ee8fe-acdf-4782-b088-ff7e92aa065b","int0":1}]},{"id":"c01e9c5d-eac5-4832-9864-103bb0f95d3a","name":"Play-Time Synthetic","textDescription":"Related to the padded synthetics and often confused with poppets, you resemble a plush or a plastic toddler's toy one would find in a modern daycare. Pull-strings that cause you to say pre-set phrases, rings of colorful and chewy rubber, and more adorn your body. You are designed to care for and entertain small children, which manifests as minor magic. You can cast the *prestidigitation* cantrip as an arcane innate spell at will.","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729521056549","listCustomEffects":[{"effectType":13,"string0":"7164dcd9-1ec5-4cb4-afca-e6f091f37776","int0":1}]}],"listCustomSpells":[{"uniqueID":"50d33676-ec0e-476b-a349-0275be280dcf","name":"Baby Bolt","type":"Spell","level":2,"traits":"Attack, Concentrate, Manipulate, Nonlethal, 3rd Party","arrayTraditions":[0,1,2,3],"actions":2,"descriptionHeightened":"You fire a ray of light pink and baby blue energy. When you cast this spell, choose either mental regression (applying the mental trait) or physical regression (applying the morph trait). Make a spell attack roll against a single creature. On a hit, the target takes 3d4 force damage, and on a critical hit, the target takes double damage and suffers a condition: If you chose mental, the target is also stupefied 1; if you chose physical, the target is either enfeebled 1 or clumsy 1, your choice.<br><br><br><b>Heightened (+1)</b> Increase the damage by 2d4","src":"Pampfinder V 1.3.1","databaseID":1,"timestamp":"1729564169237","target":"1 creature","duration":"Until the start of your next turn","range":"60 ft","save":"AC"},{"uniqueID":"0e4bfe56-3d10-4211-ac57-2af457e82f04","name":"Blessing of Birth","type":"Focus","level":5,"traits":"Rare, Focus, Hex, Vitality, Witch, 3rd Party","actions":0,"cast":"<b>Lesson</b> rebirth","descriptionHeightened":"<b>Frequency*<i> once per year; </i>*Trigger</b> You would die and your body isn't destroyed by the cause of death<br><br>Your patron refuses to allow their favored servant to fall. Instead of dying, half of your Hit Points are restored and you regress as <i>form of the babe</i>. This effect is permanent, and you can only be restored to your original age with powerful magic such as <i>wish</i>.","src":"Pampfinder V 1.3.1","databaseID":1,"timestamp":"1729183045133","target":"Self"},{"uniqueID":"9dceac88-73ca-461e-b082-73c4d277769b","name":"Chiding Gesture","type":"Focus","traits":"Uncommon, Cleric, Emotion, Focus, 3rd Party","actions":0,"cast":"<b>Trigger</b> An enemy critically hits you or an ally within range","descriptionHeightened":"You wag your finger and tsk-tsk at the naughty foe for playing too roughly. The attack deals only as much damage as it would on a hit, but any other effects caused by a critical hit still occur.","src":"Pampfinder V 1.3.1","databaseID":1,"timestamp":"1729703412731","target":"The triggering creature","range":"30 Feet"},{"uniqueID":"7e615750-f3af-4923-b31c-ec9ddcd0834c","name":"Conjure Change","type":"Cantrip","traits":"Cantrip, Concentrate, Manipulate, 3rd Party","arrayTraditions":[0,1,2,3],"actions":3,"descriptionHeightened":"You materialize a diaper or pull-up of a desired thickness, type, and design alongside a bottle of baby powder, some wipes, and some baby oil. The powder, wipes, and oil disappear immediately after you use them to change a creature into the diaper, or within 10 minutes if not used. The garment can hold twice the amount of a non-magical counterpart. When the duration ends, you can Sustain the spell to magically clean the garment and refresh its duration. You can only have one garment in existence at a time, and conjuring another will Dismiss the previous casting.","src":"Custom","databaseID":1,"timestamp":"1729564135054","duration":"Until your next daily preparations"},{"uniqueID":"8e89ef4f-1f1e-44b3-82cc-e1167f58a256","name":"Daycare Guardian Form","type":"Spell","level":9,"traits":"Concentrate, Manipulate, Polymorph, 3rd Party","arrayTraditions":[0,2,3],"actions":2,"descriptionHeightened":"You invoke the power of the guardians of ancient nurseries from bygone, powerful civilizations and gain a Huge construct battle form. When you Cast this Spell, choose a listed battle form. You can decide the specific appearance of the form, but this has no effect on its Size or statistics. While in this form, you gain the construct trait. You can Dismiss the spell.<br><br><br>You gain the following statistics and abilities regardless of which battle form you choose:<br><br><br>- AC = 22 + your level. Ignore your armor's check penalty and Speed reduction.<br>- 25 temporary Hit Points.<br>- Immunity to bleed, death effects, and the sickened condition.<br>- Resistance 10 against physical damage (except adamantine).<br>- Darkvision.<br>- One or more unarmed melee attacks specific to the battle form you choose, which are the only attacks you can Strike with. You're trained with them. Your attack modifier is +31, and your damage bonus is +20. These attacks are Strength based (for the purpose of the enfeebled condition, for example). If your unarmed attack modifier is higher, you can use it instead.<br>- Athletics modifier of +33, unless your own is higher.<br><br><br>You also gain specific abilities based on the form you choose:<br><br><br>- <b>Giant Plush</b> Speed 30 feet; **Melee** :a: fist (nonlethal, reach 15 feet), **Damage** 3d12 bludgeoning plus Grab; **Bear Hug** :a: (nonlethal), **Requirements** You have a creature grabbed; You deal 20 bludgeoning damage to the grabbed creature with a basic Fortitude save. **Antimagic** You have a +2 status bonus to saves against magic. If you roll a critical failure against a spell, you get a failure instead. A creature attempting a counteract check against you to remove this spell treats the counteract rank of this spell as one higher than its normal rank.<br><br>- <b>Hypnotic Mobile</b> Speed 5 feet, fly 35 feet; **Melee** :a: strap (nonlethal, reach 10 feet), **Damage** 2d6 slashing; **Lullaby** (auditory, aura, incapacitation, mental) 20 feet. You emit an aura of hypnotic music around you. A creature that enters or ends its turn within the aura must succeed on a Will save against your spell DC or fall unconscious. If it's still unconscious after 1 minute, it wakes up automatically. A creature can only be affected once per turn. You can activate or deactivate this aura with a Sustain action. <br><br>- <b>Wind-Up Wyrm</b> Speed 40 feet, climb 20 feet; **Melee** :a: jaws (nonlethal), **Damage** 3d12 piercing; **Melee** :a: claw (agile, nonlethal), **Damage** 3d8 slashing; **Melee** :a: tail (nonlethal, reach 10 feet), **Damage** 3d10 bludgeoning; **Vapor Breath** (water) You exhale harmless vapor from your toy gullet in a 30-foot cone. Creatures must succeed on a Reflex save or be pushed 10 feet in the cone's direction and be knocked prone. This vapor lingers in a cloud within the area. All creatures within the cloud become concealed, and all creatures outside the cloud become concealed to creatures within it.<br><br><br><b>Heightened (10th)</b> You instead gain AC = 23 + your level, 30 temporary HP, an attack modifier of +34, a damage bonus of +22, and Athletics +35.","src":"Custom","databaseID":1,"timestamp":"1729564416988","duration":"1 Minute"},{"uniqueID":"e6746f32-402d-4151-b251-cf7acbe0f50d","name":"Diaper Transmutation","type":"Spell","level":8,"traits":"Concentrate, Curse, Incapacitation, Manipulate, Polymorph, 3rd Party","arrayTraditions":[0,1,2,3],"actions":2,"descriptionHeightened":"You transform the target into a diaper for you or another creature to wear, sapping its power for the wearers' benefit.<br><br><b>Critical Success</b> The target is unaffected<br><b>Success</b> The target's body becomes crinkly and plastic-backed, resembling a diapercritter. It becomes sickened 1 and thirsts for another creature's waste, spending one action on each of its turns to try to satiate this thirst. When it recovers from the sickened condition, its features revert to normal and its thirst ends.<br><b>Failure</b> The target transforms into a diaper snugly taped to the waist of either yourself or an ally within range for 1 minute. A creature can spend a single action with the concentrate trait while wearing the diaper to use it, gaining a +2 status bonus to their next attack roll, skill check, or Perception check. If it spends all its actions on its turn concentrating on its original form, the diaper can attempt a Will save to end the effect immediately. You choose whether or not the diaper can speak in this form, and the creature's face appears somewhere on the diaper (usually the butt).<br><b>Critical Failure</b> The target is transformed into a diaper for an unlimited duration. A creature can only gain a status bonus from using the diaper for 1 minute.","src":"Custom","databaseID":1,"timestamp":"1729564552484","target":"1 Creature","duration":"varies","range":"30 feet","save":"Fortitude"},{"uniqueID":"85e1e6b6-196f-47be-a613-8243ac032399","name":"Form of the Babe","type":"Focus","level":3,"traits":"Uncommon, Focus, Hex, Manipulate, Morph, Witch, 3rd Party","actions":2,"cast":"<b>Lesson</b> youth","descriptionHeightened":"Your patron restores you to your youthful days, or makes you even younger if you aren't out of them yet.  You regress in age until you are a toddler, reducing your size to Small if you weren't already.<br> Your equipment shrinks with you and becomes appropriate to your new form, including diapers, but still functions as before. You can choose its new appearance, and your equipment remains affected for the duration until the spell ends. While regressed this way you have a +2 status bonus to Deception checks to convince others of your innocence and youth, and you add your level to such Deception checks even if untrained. You can Dismiss this spell.","src":"Pampfinder V 1.3.1","databaseID":1,"timestamp":"1729708566544","target":"Self","duration":"1 hour"},{"uniqueID":"bfe038d1-b2f5-4296-81e2-8afc2a3cc183","name":"Helpful Hug","type":"Focus","traits":"Uncommon, Concentrate, Focus, Wizard, 3rd Party","actions":1,"descriptionHeightened":"You conjure a spectral plush toy that wraps its stubby arms around a friend, encouraging them with love and possibly some vibrations. While affected by the spell, they have a +1 status bonus to their AC, and when you Cast or Sustain the spell they gain 1d4+1 temporary Hit Points.<br><b>Heightened (+2)</b> Increase the provided temporary HP by 1d4+1","src":"Pampfinder V 1.3.1","databaseID":1,"timestamp":"1729703281066","target":"1 willing creature","duration":"Sustained for up to 1 minute","range":"30 feet"},{"uniqueID":"070d6d87-17a7-490e-ae93-49ed9ab30d2c","name":"Mother's Balm","type":"Focus","traits":"Uncommon, Focus, Hex, Manipulate, Vitality, Witch, 3rd Party","actions":1,"descriptionHeightened":"Your patron soothes ongoing wounds with a motherly calm and boo boo kisses from beyond. Reduce the amount of persistent damage the target receives by 2 and the DC for their flat check to recover from any persistent damage by 2. When you Cast or Sustain this Spell, the target can immediately attempt to recover from any persistent damage it has.<br><br><br><b>Heightened (+1)</b> Further reduce damage by 2.","src":"Pampfinder V 1.3.1","databaseID":1,"timestamp":"1729703540251","target":"1 creature","duration":"Sustained up to 1 minute","range":"30 feet"},{"uniqueID":"2acaef49-a75b-49ac-9abb-4ff7d261336b","name":"Mother's Caress","type":"Focus","level":4,"traits":"Uncommon, Cleric, Concentrate, Focus, Healing, Vitality, 3rd Party","descriptionHeightened":"You reinvigorate old flesh with but a touch, healing flesh and blood as if it was born yesterday. You restore 16 hit points and attempt to counteract one disease or poison afflicting the target. When casting this spell, you can also regress a creature by 1 year.<br><br><b>Heightened (+1)</b> The amount of healing increases by 4.","src":"Pampfinder V 1.3.1","databaseID":1,"timestamp":"1729703284731","target":"1 willing living creature","range":"Touch","save":"Fortitude"},{"uniqueID":"934c1e35-95eb-481d-8d25-d42d473af52e","name":"Pacify","type":"Spell","level":5,"traits":"Concentrate, Incapacitation, Manipulate, 3rd Party","arrayTraditions":[0,1,2,3],"actions":2,"descriptionHeightened":"You conjure a pacifier made of either pure energy or a simple form of matter into the mouth of a creature, possibly preventing them from using sonic attacks, auditory actions, or speaking the magical words required to cast non-subtle spells until you let them. A creature may not be affected if it has multiple mouths or speaks without a mouth. You can Dismiss the spell. <br><br><b>Critical Success</b> The target is unaffected.<br><b>Success</b> The target is pacified for 1 round. The creature can Interact to pull the pacifier out early.<br><b>Failure</b> The target is pacified for 1 minute. It can make an Athletics check against your spell DC to try to pull the pacifier out early.<br><b>Critical Failure</b> As failure, but the target can't pull the pacifier out early.<br><br><br><b>Heightened (8th)</b> The pacifier dulls the mind of those who suckle it. While a creature has a pacifier in their mouth they are stupefied 2. In addition, if the creature has multiple mouths you will conjure enough pacifiers for each one.","src":"Pampfinder 1.3.1","databaseID":1,"timestamp":"1729565284003","target":"1 creature","duration":"varies","range":"30 feet","save":"Will"},{"uniqueID":"af2c7021-c2cb-4018-b73d-a2a3af1c5c0a","name":"Plushify Weapons","type":"Focus","level":4,"traits":"Uncommon, Concentrate, Focus, Wizard, 3rd Party","actions":2,"descriptionHeightened":"You enchant a creature's weapons both natural and unnatural to turn them into toys and prevent harm to your allies. <br><br><b>Critical Success</b> The target is unaffected.<br><b>Success</b> The target's Strikes become nonlethal and deal 2 less damage for 1 round.<br><b>Failure</b> As success, but the duration is 1 minute.<br><b>Critical Failure</b> As failure, but the damage reduction is increased to 3.<br><br><br><b>Heightened (+2)</b> Increase the damage reduction by 1.","src":"Custom","databaseID":1,"timestamp":"1729707255057","target":"1 creature","duration":"varies","range":"30 feet","save":"Fortitude"},{"uniqueID":"5be90210-b950-47cd-9306-1202da33c9cd","name":"Power Word Babble","type":"Spell","level":6,"traits":"Uncommon, Auditory, Mental, 3rd Party","arrayTraditions":[0,1,2,3],"descriptionHeightened":"You utter a magical word that can revoke the target's language upon hearing it. Once targeted, the target is then temporarily immune for 10 minutes. The effect of the spell depends on the target's level. If a creature that can speak forgets every language it previously knew as a result of this spell, it can only babble like a baby; this does not prevent it from casting non-subtle spells or using auditory actions. <br><br><b>10th or Lower</b> The target forgets every language it knows. It can re-learn these languages over time, 1 year per language.<br><b>11th-12th</b> The target forgets every language it knows for 1 minute.<br><b>13th or Higher</b> The target forgets one random language it knows for 1 minute.<br><br><br><b>Heightened (+1)</b> The levels at which each outcome applies increase by 2.","src":"Custom","databaseID":1,"timestamp":"1729566630570","target":"1 living creature","duration":"varies","range":"30 feet"},{"uniqueID":"ccbe5c0d-df98-4ced-be01-0ef4ede689be","name":"Protective Padding","type":"Spell","traits":"Concentrate, Manipulate 3rd Party","arrayTraditions":[0,1,2,3],"actions":2,"descriptionHeightened":"You conjure a particularly thick diaper around the waist of your ally, forcing them into a bow-legged stance and making a large and alluring target for strong attacks. While the target is wearing this diaper it will absorb the force of the next critical hit that strikes them, reducing the damage as if it were a normal hit, though any other effects caused by a critical hit still occur. The spell then ends. When the spell ends the diaper does not disappear but instead reduces in thickness, albeit still being waddle inducing.<br><br><br><b>Heightened (+2)</b> The padding absorbs the force of an additional critical hit.","src":"Pampfinder 1.3.1","databaseID":1,"timestamp":"1729566681656","target":"1 Willing Creature","duration":"10 minutes","range":"touch"},{"uniqueID":"dc15272d-623b-4af1-8fc0-c465ba856503","name":"Purge Impure Thought","type":"Focus","level":3,"traits":"Uncommon, Concentrate, Focus, Monk, 3rd Party","actions":1,"descriptionHeightened":"You focus your qi to shunt out non-innocent thoughts from your mind, at least temporarily. Attempt a Will save against a single mental effect currently affecting you. If you succeed, it is suppressed until the end of your turn.<br><br><br><b>Heightened (8th)</b> Instead of suppressing the effect, you remove it.","src":"Custom","databaseID":1,"timestamp":"1729704111253"},{"uniqueID":"f5bc2cc5-48bd-4984-9ee5-a949d6b98592","name":"Regress Companion","type":"Focus","traits":"Uncommon, Concentrate, Focus, Manipulate, Morph, Ranger, 3rd Party","actions":1,"descriptionHeightened":"Your animal companion is restored to its youth, a diaper hugging its hips to prevent any accidents. Your animal companion briefly becomes a familiar, and you select three familiar abilities it has for the duration. It otherwise retains its statistics, including Hit Points, AC, saves, and skills proficiencies. You can Dismiss the spell.<br><br><br><b>Heightened (4th)</b> Increase the duration to 1 hour and the number of abilities chosen to five.","src":"Custom","databaseID":1,"timestamp":"1729708352571","target":"Your animal companion","duration":"10 minutes","range":"30 feet"},{"uniqueID":"35815d04-2e8d-4ffa-aeb3-467ea5ea46bd","name":"Regression","type":"Spell","level":3,"traits":"Concentrate, Incapacitation, Manipulate, Mental, Morph, 3rd Party","arrayTraditions":[0,1,2,3],"actions":2,"descriptionHeightened":"You blast the target with youthful energy, mentally and physically regressing them. This spell does not work on children and creatures that do not age. If the target is willing, they can forgo the save to instead regress them as per the Failure effect without the harmful conditions for 10 minutes. You can Dismiss the spell if it is cast this way. <br><br><b>Critical Success</b> The target is unaffected<br><b>Success</b> The target is clumsy 1, enfeebled 1, and stupefied 1 until the start of your next turn.<br><b>Failure</b> As success, but the duration is 1 minute and the target's equipment cosmetically transforms to be childish, including a diaper. You can optionally also have them become Small in size (if it is not already Small or smaller) and cause it to rapidly lose age.<br><b>Critical Failure</b> As failure, but the target is clumsy 2, enfeebled 2, and stupefied 2.<br><br><br><b>Heightened (6th)</b> You can target up to 5 creatures. Additionally, the spell now affects creatures that do not age, transforming them into childish fascimiles of what they may have looked like as babies.<br><br><br><b>Heightened (10th)</b> Unless the target succeeds on the save, the duration is permanent.","src":"Pampfinder 1.3.1","databaseID":1,"timestamp":"1729567905170","target":"1 living creature","duration":"varies","range":"30","save":"Fortitude"},{"uniqueID":"1c2b2281-42a1-4248-9648-7dbb92554a8f","name":"Stench Squat","type":"Focus","level":2,"traits":"Uncommon, Concentrate, Focus, Poison, Ranger, 3rd Party","actions":2,"descriptionHeightened":"You scrunch up your face and squat, exposing your foes to a horrid smell as you dump your pants defensively. Each creature in the area takes 3d4 poison damage, with a Fortitude save. <br><br><b>Critical Success</b> The creature is unaffected.<br><b>Success</b> The creature takes half damage.<br><b>Failure</b> The creature takes full damage and is sickened 1.<br><b>Critical Failure</b> The creature takes double damage and is sickened 2.<br><br><br><b>Heightened (+2)</b> The damage increases by 2d4.","src":"Custom","databaseID":1,"timestamp":"1729703903429","area":"10-foot emanation"},{"uniqueID":"874d278c-ac4d-4895-8207-1c6d2166d338","name":"Terrible Tantrum","type":"Spell","level":4,"traits":"Concentrate, Manipulate, 3rd Party","arrayTraditions":[0,1,2,3],"actions":2,"descriptionHeightened":"You throw a magically enhanced tantrum, filling your pants on purpose in protest, enhancing the kinetic force behind the stomps of your feet, and amplifying the sympathy of your cries. When you Cast the Spell, choose one of the following effects to subject creatures in the area to.<br><br><br>- <b>Fill</b> (olfactory, poison) You scrunch your nose and push, dealing 5d6 poison damage (basic Fortitude save). On a failure, they are sickened 1.<br>- <b>Cry</b> (auditory, sonic) You let the tears flow and force your foes to realize you're just a little baby, dealing 5d6 mental damage (basic Will save). On a failure, they suffer a -2 circumstance penalty to their Strikes against you for 1 round.<br>- <b>Stomp</b> (earth) You send shockwaves through the earth with a defiant stomp, dealing 5d6 bludgeoning damage (basic Reflex save). On a failure, they are knocked prone.<br><br><br><b>Heightened (+1)</b> Increase the damage by 2d6","src":"Pampfinder 1.3.1","databaseID":1,"timestamp":"1729702788077","save":"varies","area":"15-foot best centered on self"},{"uniqueID":"3c204be7-22da-45b3-a2a3-32dbd4f442a5","name":"Time Out","type":"Spell","level":7,"traits":"Concentrate, Extradimensional, Incapacitation, Manipulate, Teleportation, 3rd Party","arrayTraditions":[0,1,2,3],"actions":2,"descriptionHeightened":"You temporarily banish a creature to a demiplane as a punishment for naughty behavior. While banished, the creature is subjected to humiliating punishments from an otherworldly construct appropriate to your magical tradition via spanking, long lectures, relentless babying, and more, having their naughty toys taken from them at the end. <br><br><b>Critical Success</b> The target resists being banished.<br><b>Success</b> The target is banished until the start of its next turn, and when they return they will be thickly diapered (or double diapered if they were already) and their attacks will be blunted or replaced with toys, turning their Strikes nonlethal and suffering a -10 foot circumstance penalty to its Speeds for 1 minute.<br><b>Failure</b> As success, but for 1 round.<br><b>Critical Failure</b> As success, but for 3 rounds.","src":"Pampfinder 1.3.1","databaseID":1,"timestamp":"1729702876589","target":"1 creature","duration":"varies","range":"60 feet","save":"Will"},{"uniqueID":"653b82a2-c297-47bc-bf6e-c879aa0e2a13","name":"Touch of Sleep","type":"Focus","traits":"Uncommon, Concentrate, Focus, Incapacitation, Mental, Monk, Sleep, Subtle, 3rd Party","actions":2,"descriptionHeightened":"You reach out and touch your target. Anytime during the duration, you can spend a single action, which has the auditory and concentrate traits, to inform the creature that it is their nap time and potentially put them to sleep on the spot. The target must attempt a Will save. This spell doesn't prevent creatures from waking up due to a successful Perception check. <br><br><b>Critical Success</b> The target is unaffected, the spell ends, and the target is then temporarily immune for 24 hours.<br><b>Success</b> The creature falls unconscious for 1 round,  and the target is then temporarily immune for 24 hours.<br><b>Failure</b> The creature falls unconscious for 1 minute and is sleeping normally at the end of this minute.<br><b>Critical Failure</b> The creature falls unconscious for 1 hour. At the end of this hour, it is sleeping normally.","src":"Custom","databaseID":1,"timestamp":"1729704057106","target":"1 creature","duration":"24 hours","range":"touch","save":"Will"},{"uniqueID":"05748a2a-17c5-499e-84d7-4e02492345da","name":"Tummy Trouble","type":"Cantrip","traits":"Attack, Cantrip, Concentrate, Manipulate, 3rd Party","arrayTraditions":[0,1,2,3],"actions":2,"descriptionHeightened":"You reach out to either boop the target's nose or cup their bottom, magically encouraging an accident. The target must attempt a Fortitude save. On a failure, it is sickened 1, or sickened 2 on a critical failure. When this condition ends, the creature has an accident. Regardless of the result, the target is temporarily immune to *tummy trouble* for 10 minutes. As part of this casting this spell, you can choose to conjure a diaper onto the target to contain this accident.","src":"Pampfinder V 1.3.1","databaseID":1,"timestamp":"1729702912828","target":"1 creature who can defecate","range":"Touch","save":"Fortitude"}],"listCustomSpecial":[{"name":"Absorbent","id":"f91ee8fe-acdf-4782-b088-ff7e92aa065b","description":"You can eat and drink things when you are sickened, and can even subsist on others' waste if need be. Your circumstance bonus against disease, poison, and the sickened condition increases to +2.","traits":"Padded Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045137"},{"name":"Artificial Organism","id":"329e2d67-aa29-4125-a42f-e63e11f62947","description":"While still a living creature, your body is made up of synthetic materials not found in nature, similar to a construct. You don't have the typical construct immunities or effects, but you still can be affected by effects that target a living creature, and can recover Hit Points normally as one, but you do have a +1 circumstance bonus to saving throws against death effects, disease, and poison as well as to saving throws against effects that would give you the drained, paralyzed, or sickened conditions.","traits":"Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045137"},{"name":"Auto-Changer","id":"4728b1c9-406d-4024-8e08-9133bd75335e","description":"You stuff thick diapers and baby powder into your construct and modify it to be a caretaker. Your innovation becomes trained in Medicine, and you can Command it to Treat Wounds and Administer First Aid. It can perform the Battle Medicine action as per the feat if you spend 2 actions to Command it instead of 1.","traits":"3rd Party","src":"Custom","specialType":802,"databaseID":1,"timestamp":"1729527084121"},{"name":"Bondage Expertise","id":"89462ef8-73da-498a-b801-6e018367ec9f","description":"Your body is composed of shiny and black rubber or latex. You may be a sex doll of sorts with a fetish-mask for a face, or simply a featureless humanoid made of slick material. Bondage is especially titillating for you, and your foes will find that you are very eager to embrace them and a big, tight hug. You are trained in Athletics and have a +1 circumstance bonus to Athletics checks made to Grapple creatures.","traits":"Dark Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729520839258","listCustomEffects":[{"proficiencyName":"Athletics","effectType":11,"bonusAmount":2},{"effectType":13,"string0":"977a35bf-2770-4931-a322-499d4c5dcbe6"}]},{"name":"Change Shape","id":"df1e46b5-8cf5-491e-b854-7184732763ee","description":"You change into your humanoid or object form. Each form has a specific, persistent appearance. In object form, you appear as a simple object of Small or Tiny size. You cannot take any actions other than Change Shape in object form except to speak or Hide. While in this form, you can Hide without any cover or concealment from creatures that don't realize you're alive. After being fooled once, a creature cannot be fooled again by this ability.","traits":"Synthetic, Mimic Synthetic, Concentrate, Polymorph, Arcane, 3rd Party","src":"Pampfinder","actions":1,"databaseID":1,"timestamp":"1729183045137"},{"name":"Hermetic Seal","id":"a8a51417-1d46-4250-a7ae-3384bbc340d2","description":"Rubber, skin-tight or otherwise, covers your body in an outer layer of your armor which is also fitted with various hoses to protect against contaminants. You gain the Breath Control feat and resistance against poison damage equal to 3 + half your level. When under the effects of Overdrive, the resistance increases by 2.","traits":"3rd Party","src":"Custom","specialType":801,"databaseID":1,"timestamp":"1729527048205","listCustomEffects":[{"effectType":14,"string0":"GENERAL_Breath Control","reference":"2492153a-35a8-4a87-9293-ba9ebc2171d6"}]},{"name":"Inflated","id":"4b02f886-abdc-496c-b8bd-1ccbf6b6dbf7","description":"You have weakness to piercing damage equal to one-fourth your level (minimum 1) and can Step into difficult terrain.","traits":"Synthetic, Inflated Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045138"},{"name":"Insensate Orgy","id":"fdf186ca-d8a4-4879-ac3b-45bac132f83a","description":"Your eidolon can penetrate the mind of creatures and send them free-falling into orgiastic displays of sheer lust that cause them to forget all other needs. It gains the Insensate Orgy activity. <br><br><b>Frequency</b> once per day<br><br><br>Your eidolon reaches out to up to 5 creatures within 30 feet of it, wracking their bodies in a manner akin to dogs in heat. The targets must attempt Will saves against your spell DC with the following effects. Targets that do not experience sexual pleasure are immune to this activity.<br><b>Critical Success</b> The target is unaffected<br><b>Success</b> The target becomes confused for 1 round.<br><b>Failure</b> The target drops any items they are holding and uses all of their actions on their next turn to copulate with other targets.<br><b>Critical Failure</b> As failure, but they do so for 3 rounds.","traits":"Eidolon, Emotion, Incapaciation, Mental, Occult, 3rd Party","src":"Custom","level":17,"actions":3,"databaseID":1,"timestamp":"1729561636134"},{"name":"Lesson of Comfort","id":"85fe28f5-068c-43a2-88c7-e8040cd68dea","description":"Embrace the soft and encourage comfortable living. You gain the <i>mother's balm</i> hex, and your familiar learns <i>protective padding</i>.<br>","traits":"3rd Party","src":"Pampfinder V 1.3.1","level":2,"specialType":1701,"databaseID":1,"timestamp":"1729183045138","hashMap":{"0":"070d6d87-17a7-490e-ae93-49ed9ab30d2c","1":"ccbe5c0d-df98-4ced-be01-0ef4ede689be"}},{"name":"Lesson of Rebirth","id":"f06b0aff-7aae-41db-901b-f7a7d807525c","description":"Like the pheonix rising from the ashes, a new slate provides endless potential. You gain the <i>blessing of birth</i> hex, and your familiar learns <i>never mind</i>.<br>","traits":"3rd Party","src":"Pampfinder V 1.3.1","specialType":1703,"databaseID":1,"timestamp":"1729183045138","hashMap":{"0":"0e4bfe56-3d10-4211-ac57-2af457e82f04","1":"Never Mind"}},{"name":"Lesson of Youth","id":"f3ce61b9-bc67-42b7-8876-37f6f677cc65","description":"Your patron encourages you to bring out your inner child. You gain the <i>form of the babe</i> hex, and your familiar learns <i>regression</i>.","traits":"3rd Party","src":"Pampfider V 1.3.1","specialType":1702,"databaseID":1,"timestamp":"1729183045139","hashMap":{"0":"85e1e6b6-196f-47be-a613-8243ac032399","1":"35815d04-2e8d-4ffa-aeb3-467ea5ea46bd"}},{"name":"Mimic","id":"f5a6cb83-383c-4e70-b8fb-d2110c93a13d","description":"You are made to resemble a common household object such as a training<br>potty, chest, vase, etc. This is the most common form of synthetic to be given a spark of life as opposed to being a transformed, pre-existing living creature. You are capable of swapping between an object form, which you may be more comfortable in, and a humanoid form which is more suitable for adventuring. You gain the Change Shape action.","traits":"Mimic Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045139","listCustomEffects":[{"effectType":13,"string0":"df1e46b5-8cf5-491e-b854-7184732763ee"}]},{"name":"Overwhelming Pleasure","id":"b895d84d-b28a-47b0-8a86-88dea20e30bb","description":"Your eidolon floods the dopamine centers of nearby creature's brains, tittilating them with images, feelings, and sensations of sex and the raw desires of the flesh. It can cast *synaptic pulse* once per day, and you can choose for some creatures within the emanation to be unaffected.","traits":"3rd Party","src":"Custom","level":7,"databaseID":1,"timestamp":"1729560699647","listCustomEffects":[{"proficiencyName":"Synaptic Pulse","effectType":9,"bonusType":2,"bonusAmount":5,"reference":"d23ab541-8c35-4975-9cb9-be7bf0b0045e"}]},{"name":"Pre-School of Play","id":"0f26c79b-226f-4080-8f1c-24dacdbac303","description":"Often underestimated, magicians of this pre-school wield youth magic to protect friends and curse foes.","traits":"3rd Party","src":"Custom","specialType":19,"databaseID":1,"timestamp":"1729707688280","hashMap":{"11":"bfe038d1-b2f5-4296-81e2-8afc2a3cc183","12":"af2c7021-c2cb-4018-b73d-a2a3af1c5c0a"},"mapCurriculum":{"0":{"c05b830a-01e2-4691-a44a-ed55327c207f":"7e615750-f3af-4923-b31c-ec9ddcd0834c","dfc04376-b147-4020-a38c-31a086ddaef2":"05748a2a-17c5-499e-84d7-4e02492345da"},"1":{"11c49038-b042-4a07-972f-ea5300ff51dd":"Phantasmal Minion","85bc1302-4792-403a-a314-950d3a4edf30":"Gentle Landing","7411bd6f-97ad-45ab-bfc6-07da2bec865b":"ccbe5c0d-df98-4ced-be01-0ef4ede689be"},"2":{"28e66d30-6c6a-4749-86d6-db168aeb05e5":"50d33676-ec0e-476b-a349-0275be280dcf","6c1a562e-8ad7-41bc-b36e-4cc2526f4b40":"Create Food"},"3":{"eb764058-dfdc-4663-b234-c07bfda35ebf":"35815d04-2e8d-4ffa-aeb3-467ea5ea46bd","86b6b29e-7251-4743-a0ba-a74d6e8ec3a7":"Safe Passage"},"4":{"70d99f83-4cc9-4e34-b749-4ef51aa5d800":"Peaceful Bubble","14e9a774-a154-489d-bea3-d979ebe81851":"874d278c-ac4d-4895-8207-1c6d2166d338"},"5":{"2e74a643-4bb0-4bca-a875-8e334b820174":"Cloak of Colors","78793dd3-ab60-4aa8-8727-5a07ccde8888":"934c1e35-95eb-481d-8d25-d42d473af52e"},"6":{"2febc69b-b71c-4394-a3b9-afb4ef7c0715":"Never Mind","37cb77f9-dec0-47d7-9d7b-618a06826a5e":"5be90210-b950-47cd-9306-1202da33c9cd"},"7":{"b1b973bf-f464-4522-95d4-c5f582a41dee":"Entrancing Eyes","2ce110b8-1ef4-4dde-b7e6-5583611d322e":"3c204be7-22da-45b3-a2a3-32dbd4f442a5"},"8":{"20232547-2cb8-47e7-833f-f68aef4c1e5d":"Disappearance","49b92612-9ba9-4a71-8476-946f377b0cf3":"e6746f32-402d-4151-b251-cf7acbe0f50d"},"9":{"fbbcf66a-1186-40a8-beac-1caafa96ceef":"8e89ef4f-1f1e-44b3-82cc-e1167f58a256"}}},{"name":"Robo Nanny","id":"05c861e1-3b69-40e2-8d29-e0581e0c48ee","description":"Your innovation becomes expert in Medicine. For any of these skills in which it was already an expert (because of being an advanced construct companion, for example), it gains master proficiency instead. If you have the revolutionary innovation class feature, these proficiencies improve to master, or legendary if your construct innovation was already a master. You must have the auto-changer modification to select this modification.","traits":"3rd Party","src":"Custom","specialType":802,"databaseID":1,"timestamp":"1729527122601"},{"name":"Slick Escape","id":"977a35bf-2770-4931-a322-499d4c5dcbe6","description":"You have a +1 circumstance bonus to Escape attempts made against physical bonds and creatures.","traits":"Synthetic, Dark Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045140"},{"name":"Synaptic Strikes","id":"92a1be56-e335-49dc-98a9-7aa41f396d25","description":"Your eidolon's attacks are partially immaterial and made up of pure thought. All your eidolon's unarmed Strikes deal an extra 1 mental damage. <br><br>When attacking a stupefied creature, this extra damage increases to twice the creature's stupefied value, and if the condition has a duration, it is extended by 1 round if the Strike is a critical hit.","traits":"3rd Party","src":"Custom","databaseID":1,"timestamp":"1729560593103","listCustomEffects":[{"effectType":4,"bonusType":3,"bonusAmount":1}]},{"name":"Time To Play","id":"7164dcd9-1ec5-4cb4-afca-e6f091f37776","description":"You are designed to care for and entertain small children, which manifests as minor magic. You can cast the prestidigitation cantrip as an arcane innate spell at will.","traits":"Play-Time Synthetic, 3rd Party","src":"Pampfinder","databaseID":1,"timestamp":"1729183045140","listCustomEffects":[{"proficiencyName":"Prestidigitation","effectType":9}]},{"name":"Toybreaker Instinct","id":"f55f2e87-5e07-4acb-94b8-57d8ceda86f8","description":"Your rages are legendary tantrums where you break not only bones but the very structures around you more often than not. Toys never last long in your care and your desire to break and bend extends to artificial threats in your adventuring career. You may not mean to do this - it could just be an unwanted result of your big emotions that results in teary-eyed crying after you're done - or this could possibly be the result of the trauma of being kept trapped in some sort of daycare dungeon and tended to by giant teddy bears and the like.<br><br><b>Instinct Ability - Demolishing Blows</b> Increase the additional damage from Rage from 2 to 3, or 4 against constructs and objects, and change its damage type to bludgeoning instead of the damage type for your weapon or unarmed attack. If an object is immune to critical hits, your critical hits bypass this immunity.<br><br><b>Specialization Ability (7th)</b> Increase the additional damage from Rage from 3 to 7, or 8 against constructs and objects. If you have greater raging specialization, instead increase the damage from Rage to 13, or 16 against constructs and objects. Your weapons gain the razing trait, or deal 2 additional damage to objects if they already had it.<br><br><b>Raging Resistance (9th)</b> You resist bludgeoning damage, as well as damage dealt by the attacks and abilities of constructs and traps, regardless of the damage type.","traits":"3rd Party","src":"Custom","specialType":2,"databaseID":1,"timestamp":"1729526155780"}],"listCustomAncestries":[{"name":"Synthetic","id":"e973c027-1061-497d-9090-b5b59401c0ca","traits":"Construct, Humanoid, 3rd Party, Rare","abilityBoosts":[5,2],"abilityFlaws":[3],"description":"A newer phenomenon, synthetics are the result of magical, alchemical, and otherworldly phenomena and experiments that transforms an individual into an artificial being, or even imbues an existing creation with the spark of life. They are analogous to fleshwarps and poppets in this way and may find kindred with them, but their mannerisms tend to put off the more morose former and their livacious nature puts o  the latter. Synthetic is a general term, with individuals referring to themselves by different names according to the material their bodies are primarily composed of. Synthetics made of rubber, plastic, latex, porcelain, metal, and more exist. Some synthetics are even made of a multitude of smaller objects or of multiple materials that compose a specific object, like a diaper. Some synthetics are even capable of transforming other creatures into beings like them, whether through ritual or some contagious aspect of their being, the rumors of which does tend to ostracize them from some aspects of society out of fear. Despite this, synthetics are a very 'silly' folk. Something about their existence causes them to be a very easily amused and even childish people, much to the chagrin of those that used to be very serious, and they often have short attention spans and no filter. They also tend to have high libido to the point of sometimes being hypersexual; they almost universally lack genitals, however, so their idea of sex is typically outside of the norm. If you want a bombastic character who utilizes their strange biology to endure challenges and provide new perspectives, you should play a synthetic.","languages":"Common<br>Additional languages equal to 1 + your Intelligence modifier (if it's<br>positive). Choose from the list of common languages and any other languages to which you have access (such as the languages from your past life or your region)","special":"<b>Low Light Vision</b><br><br>You can see in dim light as though it were bright light, so you ignore the concealed condition due to dim light.<br><br><br><br><b>Artificial Organism</b><br><br>While still a living creature, your body is made up of synthetic materials not found in nature, similar to a construct. You don't<br>have the typical construct immunities or effects, but you still can be affected by effects that target a living creature, and can recover Hit Points normally as one, but you do have a +1 circumstance bonus to saving throws against death effects, disease, and poison as well as to saving throws against effects that would give you the drained, paralyzed, or sickened conditions.","listCustomEffects":[{"effectType":13,"string0":"329e2d67-aa29-4125-a42f-e63e11f62947","reference":"fd3bbc60-213e-4c09-b935-33493ada721f"}],"src":"Pampfinder","databaseID":1}],"listCustomEidolons":[{"name":"Psychosexual Manifestation Eidolon","id":"36ed135c-36d6-4eab-883d-b8edb147ac38","tradition":2,"traits":"Aberration, Eidolon, Mental, 3rd Party","skill1":"Occultism","skill2":"None","type1":"Solidified Fetish","type2":"Exploring Maelstrom","array1":[18,14,16,8,10,12],"array2":[14,18,16,8,10,12],"ac1":2,"dexcap1":3,"ac2":1,"dexcap2":4,"senses":"Darkvision","description":"Your eidolon is a powerful thoughtform coalesced from the swirling mass of the collective zeitgeist of mortal creatures representing some sort of aspect or facet of sexuality. These eidolons initially take abstract forms of esoteric symbolism or resemble writhing polyps of humanoid sexual organs but tend to solidify over time as their bond with a master grows. Your link to your eidolon gives you insight into your own subconscious desires and that of those around you.\n\n(PATHBUILDER: Second Proficiency is a Custom Lore for a particular Fetish)","src":"Custom","databaseID":1,"abilityInitial":{"name":"Synaptic Strikes","id":"92a1be56-e335-49dc-98a9-7aa41f396d25","description":"Your eidolon's attacks are partially immaterial and made up of pure thought. All your eidolon's unarmed Strikes deal an extra 1 mental damage. <br><br>When attacking a stupefied creature, this extra damage increases to twice the creature's stupefied value, and if the condition has a duration, it is extended by 1 round if the Strike is a critical hit.","traits":"3rd Party","src":"Custom","databaseID":1,"listCustomEffects":[{"effectType":4,"bonusType":3,"bonusAmount":1}]},"abilitySymbiosis":{"name":"Insensate Orgy","id":"fdf186ca-d8a4-4879-ac3b-45bac132f83a","description":"Your eidolon can penetrate the mind of creatures and send them free-falling into orgiastic displays of sheer lust that cause them to forget all other needs. It gains the Insensate Orgy activity. <br><br><b>Frequency</b> once per day<br><br><br>Your eidolon reaches out to up to 5 creatures within 30 feet of it, wracking their bodies in a manner akin to dogs in heat. The targets must attempt Will saves against your spell DC with the following effects. Targets that do not experience sexual pleasure are immune to this activity.<br><b>Critical Success</b> The target is unaffected<br><b>Success</b> The target becomes confused for 1 round.<br><b>Failure</b> The target drops any items they are holding and uses all of their actions on their next turn to copulate with other targets.<br><b>Critical Failure</b> As failure, but they do so for 3 rounds.","traits":"Eidolon, Emotion, Incapaciation, Mental, Occult, 3rd Party","src":"Custom","level":17,"actions":3,"databaseID":1},"abilityTransendence":{"name":"Overwhelming Pleasure","id":"b895d84d-b28a-47b0-8a86-88dea20e30bb","description":"Your eidolon floods the dopamine centers of nearby creature's brains, tittilating them with images, feelings, and sensations of sex and the raw desires of the flesh. It can cast *synaptic pulse* once per day, and you can choose for some creatures within the emanation to be unaffected.","traits":"3rd Party","src":"Custom","level":7,"databaseID":1,"listCustomEffects":[{"proficiencyName":"Synaptic Pulse","effectType":9,"bonusType":2,"bonusAmount":5,"reference":"d23ab541-8c35-4975-9cb9-be7bf0b0045e"}]}},{"name":"Psychosexual Manifestation Eidolon","id":"36ed135c-36d6-4eab-883d-b8edb147ac38","tradition":2,"traits":"Aberration, Eidolon, Mental, 3rd Party","skill1":"Occultism","skill2":"None","type1":"Solidified Fetish","type2":"Exploring Maelstrom","array1":[18,14,16,8,10,12],"array2":[14,18,16,8,10,12],"ac1":2,"dexcap1":3,"ac2":1,"dexcap2":4,"senses":"Darkvision","description":"Your eidolon is a powerful thoughtform coalesced from the swirling mass of the collective zeitgeist of mortal creatures representing some sort of aspect or facet of sexuality. These eidolons initially take abstract forms of esoteric symbolism or resemble writhing polyps of humanoid sexual organs but tend to solidify over time as their bond with a master grows. Your link to your eidolon gives you insight into your own subconscious desires and that of those around you.\n\n(PATHBUILDER: Second Proficiency is a Custom Lore for a particular Fetish)","src":"Custom","databaseID":1,"abilityInitial":{"name":"Synaptic Strikes","id":"92a1be56-e335-49dc-98a9-7aa41f396d25","description":"Your eidolon's attacks are partially immaterial and made up of pure thought. All your eidolon's unarmed Strikes deal an extra 1 mental damage. <br><br>When attacking a stupefied creature, this extra damage increases to twice the creature's stupefied value, and if the condition has a duration, it is extended by 1 round if the Strike is a critical hit.","traits":"3rd Party","src":"Custom","databaseID":1,"listCustomEffects":[{"effectType":4,"bonusType":3,"bonusAmount":1}]},"abilitySymbiosis":{"name":"Insensate Orgy","id":"fdf186ca-d8a4-4879-ac3b-45bac132f83a","description":"Your eidolon can penetrate the mind of creatures and send them free-falling into orgiastic displays of sheer lust that cause them to forget all other needs. It gains the Insensate Orgy activity. <br><br><b>Frequency</b> once per day<br><br><br>Your eidolon reaches out to up to 5 creatures within 30 feet of it, wracking their bodies in a manner akin to dogs in heat. The targets must attempt Will saves against your spell DC with the following effects. Targets that do not experience sexual pleasure are immune to this activity.<br><b>Critical Success</b> The target is unaffected<br><b>Success</b> The target becomes confused for 1 round.<br><b>Failure</b> The target drops any items they are holding and uses all of their actions on their next turn to copulate with other targets.<br><b>Critical Failure</b> As failure, but they do so for 3 rounds.","traits":"Eidolon, Emotion, Incapaciation, Mental, Occult, 3rd Party","src":"Custom","level":17,"actions":3,"databaseID":1},"abilityTransendence":{"name":"Overwhelming Pleasure","id":"b895d84d-b28a-47b0-8a86-88dea20e30bb","description":"Your eidolon floods the dopamine centers of nearby creature's brains, tittilating them with images, feelings, and sensations of sex and the raw desires of the flesh. It can cast *synaptic pulse* once per day, and you can choose for some creatures within the emanation to be unaffected.","traits":"3rd Party","src":"Custom","level":7,"databaseID":1,"listCustomEffects":[{"proficiencyName":"Synaptic Pulse","effectType":9,"bonusType":2,"bonusAmount":5,"reference":"d23ab541-8c35-4975-9cb9-be7bf0b0045e"}]}}]}